fdcavalcanti/esp-bist-hmi/hmi/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
# SPIRAM_SPEED_200M depends on IDF_EXPERIMENTAL_FEATURES, which must be set first
# or Kconfig silently falls back to 20MHz and the MIPI DSI panel underruns.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# IDF 6.0 defaults to rev v3.1 and hides the <3.0 revisions behind this toggle;
# without it the Tab5's rev v1.x P4 is rejected by the bootloader image check.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Double LVGL's standard 14 px font for the touch HMI.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28=y

# Modbus master defaults (RS485: RX=21, TX=20, DIR/RTS=34)
CONFIG_MB_COMM_MODE_ASCII=n
CONFIG_MB_COMM_MODE_RTU=y
CONFIG_MB_UART_BAUD_RATE=115200
CONFIG_MB_UART_RXD=21
CONFIG_MB_UART_TXD=20
CONFIG_MB_UART_RTS=34
CONFIG_FMB_TIMER_USE_ISR_DISPATCH_METHOD=y
CONFIG_FMB_MASTER_DELAY_MS_CONVERT=200
CONFIG_FMB_MASTER_TIMEOUT_MS_RESPOND=400
CONFIG_FMB_EXT_TYPE_SUPPORT=y

CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=16240

CONFIG_ESP_BIST=y
CONFIG_ESP_BIST_CPU_REG_TEST=y
CONFIG_ESP_BIST_CPU_CSR_REG_TEST=y
CONFIG_ESP_BIST_STACK_TEST=y
CONFIG_ESP_BIST_MEMORY_RAM_TEST=y
# 64-word partitions → 512 B Abraham pair + 512 B backup; fits LP SRAM with HDA.
CONFIG_ESP_BIST_RAM_PARTITION_SIZE=64
CONFIG_ESP_BIST_MEMORY_FLASH_TEST=y
CONFIG_ESP_BIST_WDT_TIMEOUT_US=50000
CONFIG_ESP_BIST_HOST_DIAGNOSTICS=y
CONFIG_ESP_BIST_HD_AUDIT_QA=y
# Companion waits this long for AGENT_READY (and 10x for POSTBOOT_DONE).
CONFIG_ESP_BIST_HD_AGENT_READY_TIMEOUT_US=5000000